POPUP_TEXT = """\
Відчуй <b>REASONANCE</b> – зареєструйся тут, щоб першим потрапити на pop-up та познайомитись з ароматами ближче.

<em>Для відвідування події необхідна реєстрація. \
Це займе менше 1 хвилини.</em>

Я вдячний тобі за увагу!
"""

ASK_NAME = {
    "valid": "1/4. Введи своє ім'я та прізвище, будь ласка 👇",
    "invalid": "Будь ласка, введи повне ім'я та прізвище 👇"
}
ASK_PHONE = {
    "valid": "2/4. А тепер мені потрібен твій номер телефону (можна кнопкою “Надіслати контакт”) 👇",
    "invalid": "Будь ласка, введи номер у форматі +380XXXXXXXX (можна кнопкою “Надіслати контакт”) 👇"
}
ASK_EMAIL = {
    "valid": "3/4. Додай email, ми майже завершили 👇",
    "invalid": "Будь ласка, введи коректний email 👇"
}
ASK_DATE = {
    "valid": "4/4. Обери дату твого візиту, будь ласка 👇",
    "invalid": "Будь ласка, обери доступну дату з кнопок 👇",
    "buttons": ["31.10", "01.11", "02.11"]
}

POPUP_END_TEXT = {
    "intro": "Ти зареєстрований(а) на мій перший Pop-Up!",
    "caption": "Ось твій електронний квиток.", 
    "end": "До зустрічі!"
}

POP_UP_LOCATION = "The Naked Room, Київ, вул. Рейтарська, 21"

POP_UP_REMINDER = {
"5days": f"""\
Привіт! Нагадую про наш перший Reasonance Pop-Up 
Дата: [date]
Адреса: {POP_UP_LOCATION} 
Дуже чекаю на зустріч з тобою!""",

"3days": f"""\
Вже зовсім скоро Reasonance Pop-Up 
Дата: [date]
Адреса: {POP_UP_LOCATION}
Побачимось!""",

"1day": f"""\
Вже зовсім скоро Reasonance Pop-Up 
Дата: [date]
Адреса: {POP_UP_LOCATION}
Побачимось!"""
}
