POPUP_TEXT = """\
Відчуй <b>REASONANCE</b>  – зареєструйся тут, щоб потрапити на перший особливий день pop-up 31 жовтня та познайомитись з ароматами ближче. 1 та 2 листопада я також буду чекати на тебе.

<em>Для відвідування події необхідна реєстрація. Це займе менше 1 хвилини.</em>

Дякую за увагу!
"""

ASK_NAME = {
    "valid": "1/3. Введи своє ім'я та прізвище, будь ласка ↓",
    "invalid": "Будь ласка, введи повне ім'я та прізвище ↓"
}
ASK_PHONE = {
    "valid": "2/3. А тепер мені потрібен твій номер телефону (можна кнопкою “Надіслати контакт”) 👇",
    "invalid": "Будь ласка, введи номер у форматі +380XXXXXXXX (можна кнопкою “Надіслати контакт”) 👇"
}
ASK_EMAIL = {
    "valid": "3/3. Додай email, ми майже завершили ↓",
    "invalid": "Будь ласка, введи коректний email ↓"
}
POP_UP_DATE = "31.10.2025"
POP_UP_TIME = "18:00 - 21:00"
POP_UP_LOCATION = "The Naked Room (вул. Рейтарська, 21)"

POPUP_END_TEXT = {
    "img": "imgs/reply_img.png",
    "caption": f"▫️{POP_UP_DATE}\n"\
                f"▫️{POP_UP_TIME}\n"\
                f"▫️{POP_UP_LOCATION}\n\n"\
                f"До зустрічі!"
}




