POPUP_START_TEXT = """\
Відчуй <b>REASONANCE</b> 𓂃 зареєструйся на перший особливий день pop-up 31 жовтня -  з імерсивним досвідом проживання та занурення,\
щоб познайомитись з ароматами ближче. Кількість місць обмежена. 

🪽1 та 2 листопада відвідування без реєстрації.

<em>Для відвідування події необхідна реєстрація. Це займе менше 1 хвилини.</em>
"""

POPUP_START_GIF = "imgs/popup.gif"

ASK_NAME = {
    "valid": "<b>1•3. Введи своє ім'я та прізвище, будь ласка ↓</b>",
    "invalid": "<b>Будь ласка, введи повне ім'я та прізвище ↓</b>"
}
ASK_PHONE = {
    "valid": "<b>2•3. А тепер мені потрібен твій номер телефону (можна кнопкою “Надіслати контакт”) ↓</b>",
    "invalid": "<b>Будь ласка, введи номер у форматі +380XXXXXXXX (можна кнопкою “Надіслати контакт”) ↓</b>"
}
ASK_EMAIL = {
    "valid": "<b>3•3. Додай email, ми майже завершили ↓</b>",
    "invalid": "<b>Будь ласка, введи коректний email ↓</b>"
}
POP_UP_DATE = "31.10.2025"
POP_UP_TIME = "18:00 - 21:00"
POP_UP_LOCATION = "The Naked Room (вул. Рейтарська, 21)"

POPUP_END_TEXT = {
    "img": "imgs/IMG_6774.JPG",
    "caption": f"⋰{POP_UP_DATE}\n"\
                f"⋰{POP_UP_TIME}\n"\
                f"⋰{POP_UP_LOCATION}\n\n"\
                f"Простір щойно впізнав тебе.🪽",
    "final": "Я нагадаю тобі про подію, залишаємось на зв'язку 🤍"
}





